In [1]:
import pandas as pd
import numpy as np

In [2]:
Estonia_weather=pd.DataFrame({'city':['Tartu','Tallin',"Narva"],'temprature':[24,25,22],'humidity':[70,80,85]})
Estonia_weather

     city  temprature  humidity
0   Tartu          24        70
1  Tallin          25        80
2   Narva          22        85

In [3]:
USA_weather=pd.DataFrame({'city':['Newyork','Chicago',"Orlando"],'temprature':[21,14,35],'humidity':[68,65,74]})
USA_weather

      city  temprature  humidity
0  Newyork          21        68
1  Chicago          14        65
2  Orlando          35        74

In [4]:
df=pd.concat([Estonia_weather,USA_weather],ignore_index=True)
df

      city  temprature  humidity
0    Tartu          24        70
1   Tallin          25        80
2    Narva          22        85
3  Newyork          21        68
4  Chicago          14        65
5  Orlando          35        74

In [5]:
df=pd.concat([Estonia_weather,USA_weather],keys=['Estonia','USA'])
df

              city  temprature  humidity
Estonia 0    Tartu          24        70
        1   Tallin          25        80
        2    Narva          22        85
USA     0  Newyork          21        68
        1  Chicago          14        65
        2  Orlando          35        74

In [6]:
df.loc['USA']

      city  temprature  humidity
0  Newyork          21        68
1  Chicago          14        65
2  Orlando          35        74

In [7]:
tempratur_df=pd.DataFrame({'city':['Tartu','Tallin',"Narva"],'temprature':[24,25,22]})
tempratur_df

     city  temprature
0   Tartu          24
1  Tallin          25
2   Narva          22

In [8]:
windspeed_df=pd.DataFrame({'city':['Tartu','Tallin',"Narva"],'windspeed':[9,10,13]})
windspeed_df

     city  windspeed
0   Tartu          9
1  Tallin         10
2   Narva         13

In [9]:
df=pd.concat([tempratur_df,windspeed_df],axis=1)
df

     city  temprature    city  windspeed
0   Tartu          24   Tartu          9
1  Tallin          25  Tallin         10
2   Narva          22   Narva         13

In [13]:
windspeed_df2=pd.DataFrame({'city':['Tallin',"Narva"],'windspeed':[9,10]})
windspeed_df2

     city  windspeed
0  Tallin          9
1   Narva         10

In [16]:
#we need to fix the index
df=pd.concat([tempratur_df,windspeed_df2],axis=1)
df

     city  temprature    city  windspeed
0   Tartu          24  Tallin        9.0
1  Tallin          25   Narva       10.0
2   Narva          22     NaN        NaN

In [ ]:
#defining indexes
tempratur_df=pd.DataFrame({'city':['Tartu','Tallin',"Narva"],'temprature':[24,25,22]},index=[1,2,3])

windspeed_df2=pd.DataFrame({'city':['Tallin',"Narva"],'windspeed':[9,10]},index[2,3])

In [17]:
df=pd.concat([tempratur_df,windspeed_df2],axis=1)
df

     city  temprature    city  windspeed
0   Tartu          24  Tallin        9.0
1  Tallin          25   Narva       10.0
2   Narva          22     NaN        NaN

In [18]:
#doing concat with series
s=pd.Series(['humid','sunny','snow'],name='event')
s

0    humid
1    sunny
2     snow
Name: event, dtype: object

In [19]:
df=pd.concat([tempratur_df,s],axis=1)
df

     city  temprature  event
0   Tartu          24  humid
1  Tallin          25  sunny
2   Narva          22   snow